ConfigFiles/Catalogs/ШагиПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШагиПроцесса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Процессы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребованияКСистеме</Name>
					<Comment>Требования к системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗаметок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийРаботыПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииРаботыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункцияСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОбъектаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФормыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыСценария</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоСсылке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПроизвольное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметраПоСсылке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийПараметр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипПараметраСценарияИлиПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШагПроцессаЗначениеПоСсылке</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШагиПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/ШагиПроцесса/Forms/УстановкаЗначенияПараметра/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДопПараметры = Новый Структура;
	ПараметрыПроцесса      = Тестирование.ПараметрыПроцесса(Параметры.Процесс);
	ПараметрыШаговПроцесса = Тестирование.ПараметрыШаговПроцессаПоСценарию(Параметры.Процесс,Параметры.ШагПроцесса);
	
	ТаблицаПараметров.Очистить();
	
	НомерПараметра = 0;
	Для Каждого СтрокаПараметрыПроцесса Из ПараметрыПроцесса Цикл
		НомерПараметра = НомерПараметра + 1;
		СтрокаТаблицаПараметров = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаПараметров,СтрокаПараметрыПроцесса);
		СтрокаТаблицаПараметров.НомерПараметра = НомерПараметра;
		СтрокаТаблицаПараметров.Источник = "Общий параметр";
		
		
		Если СтрокаТаблицаПараметров.Источник = Параметры.ШагПроцессаЗначениеПоСсылке 
			И СтрокаТаблицаПараметров.Имя = Параметры.ИмяПараметраПоСсылке Тогда
				СтрокаТаблицаПараметров.АктивнаяСтрока = Истина;
		ИначеЕсли СтрокаТаблицаПараметров.Источник = "Общий параметр"
			И СтрокаТаблицаПараметров.Имя = Параметры.ИмяПараметраПоСсылке Тогда
				СтрокаТаблицаПараметров.АктивнаяСтрока = Истина;
		КонецЕсли;	 
	КонецЦикла;	 
	
	
	Для Каждого СтрокаПараметрыШаговПроцесса Из ПараметрыШаговПроцесса Цикл
		НомерПараметра = НомерПараметра + 1;
		СтрокаТаблицаПараметров = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаПараметров,СтрокаПараметрыШаговПроцесса);
		СтрокаТаблицаПараметров.НомерПараметра = НомерПараметра;
		СтрокаТаблицаПараметров.Источник = СтрокаПараметрыШаговПроцесса.ШагПроцесса;
		
		
		Если СтрокаТаблицаПараметров.Источник = Параметры.ШагПроцессаЗначениеПоСсылке 
			И СтрокаТаблицаПараметров.Имя = Параметры.ИмяПараметраПоСсылке Тогда
				СтрокаТаблицаПараметров.АктивнаяСтрока = Истина;
		КонецЕсли;	 
	КонецЦикла;	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого СтрокаТаблицаПараметров Из ТаблицаПараметров Цикл
		Если СтрокаТаблицаПараметров.АктивнаяСтрока Тогда
			Элементы.ТаблицаПараметров.ТекущаяСтрока = СтрокаТаблицаПараметров.ПолучитьИдентификатор();
		КонецЕсли;	 
	КонецЦикла;	 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицаПараметров

&НаКлиенте
Процедура ТаблицаПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	Данные = ТаблицаПараметров[ВыбраннаяСтрока];
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("УстановкаПараметра",ПолучитьЗначенияПараметров(Данные));
	ОповеститьОВыборе(ВозвращаемоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровЗначениеПроизвольноеПриИзменении(Элемент)
	Элемент.Родитель.ТекущиеДанные.Значение              = Неопределено;
	Элемент.Родитель.ТекущиеДанные.КлючЗначенияПараметра = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Если Элементы.ТаблицаПараметров.ТекущиеДанные = Неопределено Тогда
		Закрыть();
	КонецЕсли;	 
	
	ОповеститьОВыборе(ПолучитьЗначенияПараметров(Элементы.ТаблицаПараметров.ТекущиеДанные));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьЗначенияПараметров(Данные)
	Структура = Новый Структура;
	Структура.Вставить("Источник",Данные.Источник);
	Структура.Вставить("Имя",Данные.Имя);
	Структура.Вставить("ТипПараметра",Данные.ТипПараметра);
	Структура.Вставить("Значение",Данные.Значение);
	Структура.Вставить("ЗначениеПроизвольное",Данные.ЗначениеПроизвольное);
	Возврат Структура;
КонецФункции	

#КонецОбласти
